export const data = [
  {
    id: '01',
    name: '面板01',
    isOpen: true,
    children: [
      {
        id: '011',
        name: '面板01-1',
        children: [
          {
            id: '011-1',
            name: '面板01-1-1',
          },
          {
            id: '011-2',
            name: '面板01-1-2',
          },
        ],
      },
      {
        id: '012',
        name: '面板01-2',
        children: [
          {
            id: '012-1',
            name: '面板01-2-1',
          },
          {
            id: '012-2',
            name: '面板01-2-2',
            children: [
              {
                id: '012-2-1',
                name: '面板01-1',
                children: [
                  {
                    id: '012-2-1-1',
                    name: '面板01-1-1',
                  },
                  {
                    id: '012-2-1-2',
                    name: '面板01-1-2',
                  },
                ],
              },
              {
                id: '012-2-2',
                name: '面板01-2',
                children: [
                  {
                    id: '012-2-2-1',
                    name: '面板01-2-1',
                  },
                  {
                    id: '012-2-2-2',
                    name: '面板01-2-2',
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    id: '03',
    name: '面板01',
    children: [
      {
        id: '031',
        name: '面板01-1',
        children: [
          {
            id: '013-1',
            name: '面板01-1-1',
          },
          {
            id: '013-2',
            name: '面板01-1-2',
          },
        ],
      },
      {
        id: '032',
        name: '面板01-2',
        children: [
          {
            id: '032-1',
            name: '面板01-2-1',
          },
          {
            id: '032-2',
            name: '面板01-2-2',
            children: [
              {
                id: '031',
                name: '面板01-1',
                children: [
                  {
                    id: '031-1',
                    name: '面板01-1-1',
                  },
                  {
                    id: '031-2',
                    name: '面板01-1-2',
                  },
                ],
              },
              {
                id: '032',
                name: '面板01-2',
                children: [
                  {
                    id: '032-1',
                    name: '面板01-2-1',
                  },
                  {
                    id: '032-2',
                    name: '面板01-2-2',
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    id: '04',
    name: '面板01',
    children: [
      {
        id: '041',
        name: '面板01-1',
        children: [
          {
            id: '041-1',
            name: '面板01-1-1',
          },
          {
            id: '041-2',
            name: '面板01-1-2',
          },
        ],
      },
      {
        id: '042',
        name: '面板01-2',
        children: [
          {
            id: '042-1',
            name: '面板01-2-1',
          },
          {
            id: '042-2',
            name: '面板01-2-2',
            children: [
              {
                id: '041',
                name: '面板01-1',
                children: [
                  {
                    id: '041-1',
                    name: '面板01-1-1',
                  },
                  {
                    id: '041-2',
                    name: '面板01-1-2',
                  },
                ],
              },
              {
                id: '042',
                name: '面板01-2',
                children: [
                  {
                    id: '042-1',
                    name: '面板01-2-1',
                  },
                  {
                    id: '042-2',
                    name: '面板01-2-2',
                    children: [
                      {
                        id: '042-2-1',
                        name: '面板01-2-1',
                      },
                      {
                        id: '042-2-2',
                        name: '面板01-2-2',
                        children: [
                          {
                            id: '042-2-2041',
                            name: '面板01-1',
                            children: [
                              {
                                id: '042-2-2041-1',
                                name: '面板01-1-1',
                              },
                              {
                                id: '042-2-2041-2',
                                name: '面板01-1-2',
                              },
                            ],
                          },
                          {
                            id: '042-2-2042',
                            name: '面板01-2',
                            children: [
                              {
                                id: '042-2-2042-1',
                                name: '面板01-2-1',
                              },
                              {
                                id: '042-2-2042-2',
                                name: '面板01-2-2',
                              },
                            ],
                          },
                        ],
                      },
                    ],
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
];
